Documents/ИнвентаризацияПотребительскихУпаковокМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ИнвентаризацияПотребительскихУпаковокМДЛП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеИнвентаризацииПотребительскихУпаковокМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаДеятельностиМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентаризационнаяОпись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризационнаяОписьМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборИнвентаризации</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПодтверждения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПодтвержденияМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НомераУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФактическоеНаличие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКИЗ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НомерУпаковкиМДЛП</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючУпаковки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихкодBase64</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатАнализаУпаковок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОписанияРезультатовАнализаИнвентаризируемыхУпаковокМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействиеПоСверкеОстатков</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДальнейшиеДействияИнвентаризацииМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействиеПоОформлениюУведомлений</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДальнейшиеДействияИнвентаризацииМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходныйСтатусМДЛП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусМДЛП</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыУпаковокМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИБ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыУпаковокМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСтатусаМДЛП</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСтатусаИБ</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРодительскойУпаковкиМДЛП</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.SSCC</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРодительскойУпаковкиИБ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.SSCC</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерхнеуровневойУпаковкиМДЛП</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.SSCC</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерхнеуровневойУпаковкиИБ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.SSCC</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаАктуальности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСерии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГоденДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИерархияГрупповыхУпаковокМДЛП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУпаковки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.SSCC</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючУпаковки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРодительскойУпаковки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.SSCC</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерхнеуровневойУпаковки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.SSCC</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходныйСтатус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыУпаковокМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСтатуса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИерархияГрупповыхУпаковокИБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУпаковки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.SSCC</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючУпаковки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРодительскойУпаковки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.SSCC</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерхнеуровневойУпаковки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.SSCC</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыУпаковокМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСтатуса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ИнвентаризированныеУпаковкиМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ИнвентаризированныеУпаковкиМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДействиеПоСверкеОстатков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияИнвентаризацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусДействияПоСверкеОстатков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДействийПоИнвентаризацииУпаковокМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеПоОформлениюУведомлений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияИнвентаризацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусДействияПоОформлениюУведомлений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДействийПоИнвентаризацииУпаковокМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерУпаковки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерУпаковкиМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаДеятельностиМДЛП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвентаризационнаяОпись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризационнаяОписьМДЛП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументИнвентаризации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументИнвентаризацииМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументУведомление</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УведомлениеИнвентаризацииПотребительскихУпаковокМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ИнвентаризацияПотребительскихУпаковокМДЛП/Forms/ФормаОформленияУведомлений/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Документ = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИнициализироватьРежимыОбработкиДокумента();
	
	Документ = Параметры.Документ;
	РежимОбработкиДокумента = Параметры.РежимОбработкиДокумента;
	
	ОбновитьДеревоУведомлений();
	
	СобытияФормМДЛППереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьУведомленияИнвентаризацииМДЛП"
	   И Параметр.ДокументИнвентаризации = Документ Тогда
		
		ПодключитьОбработчикОжидания("ОбновитьДеревоУведомленийОтложенно", 0.1, Истина);
		
	КонецЕсли;
	
	СобытияФормМДЛПКлиентПереопределяемый.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДеревоУведомленийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ДокументУведомлениеПредставление Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные.ДокументУведомлениеПредставление = Строка_Создать() Тогда
			
			Если РежимОбработкиДокумента = РежимыОбработкиДокумента.РежимПросмотра Тогда
				Возврат;
			КонецЕсли;
			
			ИмяФормыУведомления = ТекущиеДанные.ДокументУведомлениеПолноеИмя + ".ФормаОбъекта";
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Основание", Документ);
			
			ОткрытьФорму(ИмяФормыУведомления, ПараметрыФормы);
			
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ДокументУведомление) Тогда
			
			ПоказатьЗначение(, ТекущиеДанные.ДокументУведомление);
			
		КонецЕсли;
		
	ИначеЕсли Поле = Элементы.Примечание Тогда
		
		ПодключитьОбработчикОжидания("ПоказатьДеревоПересекающихсяУведомлений", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПересекающихсяУведомленийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ДеревоПересекающихсяУведомленийДокументУведомление Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ПоказатьЗначение(, ТекущиеДанные.ДокументУведомление);
		
	ИначеЕсли Поле = Элементы.ДеревоПересекающихсяУведомленийДокументУведомлениеПересекающийся Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ПоказатьЗначение(, ТекущиеДанные.ДокументУведомлениеПересекающийся);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	#Область ДеревоУведомлений
		
		//
		Элемент = УсловноеОформление.Элементы.Добавить();
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДокументУведомлениеПредставление.Имя);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор,
			"ДеревоУведомлений.Уровень", 0, ВидСравненияКомпоновкиДанных.Равно);
		
		Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
		//
		Элемент = УсловноеОформление.Элементы.Добавить();
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДокументУведомлениеТип.Имя);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор,
			"ДеревоУведомлений.Уровень", 1, ВидСравненияКомпоновкиДанных.Равно);
		
		Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
		//
		Элемент = УсловноеОформление.Элементы.Добавить();
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.СтатусУведомления.Имя);
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДальнейшееДействиеУведомления.Имя);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор,
			"ДеревоУведомлений.ДокументУведомление",, ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
		Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
		//
		Элемент = УсловноеОформление.Элементы.Добавить();
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоУведомлений.Имя);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор,
			"ДеревоУведомлений.Уровень", 1, ВидСравненияКомпоновкиДанных.Равно);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор,
			"ДеревоУведомлений.ДокументУведомление",, ВидСравненияКомпоновкиДанных.НеЗаполнено);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор,
			"РежимОбработкиДокумента", "РежимПросмотра", ВидСравненияКомпоновкиДанных.Равно);
		
		Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
	#КонецОбласти
	
	#Область ДеревоПересекающихсяУведомлений
		
		//
		Элемент = УсловноеОформление.Элементы.Добавить();
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПересекающихсяУведомленийДокументУведомлениеПересекающийся.Имя);
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПересекающихсяУведомленийНомерУпаковки.Имя);
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПересекающихсяУведомленийСтатусУведомленияПересекающийся.Имя);
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПересекающихсяУведомленийДальнейшееДействиеУведомленияПересекающийся.Имя);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор,
			"ДеревоПересекающихсяУведомлений.Уровень", 0, ВидСравненияКомпоновкиДанных.Равно);
		
		Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
		//
		Элемент = УсловноеОформление.Элементы.Добавить();
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПересекающихсяУведомленийДокументУведомление.Имя);
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПересекающихсяУведомленийНомерУпаковки.Имя);
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПересекающихсяУведомленийСтатусУведомления.Имя);
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПересекающихсяУведомленийДальнейшееДействиеУведомления.Имя);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор,
			"ДеревоПересекающихсяУведомлений.Уровень", 1, ВидСравненияКомпоновкиДанных.Равно);
		
		Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
		//
		Элемент = УсловноеОформление.Элементы.Добавить();
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПересекающихсяУведомленийДокументУведомление.Имя);
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПересекающихсяУведомленийДокументУведомлениеПересекающийся.Имя);
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПересекающихсяУведомленийСтатусУведомления.Имя);
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПересекающихсяУведомленийДальнейшееДействиеУведомления.Имя);
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПересекающихсяУведомленийСтатусУведомленияПересекающийся.Имя);
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПересекающихсяУведомленийДальнейшееДействиеУведомленияПересекающийся.Имя);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор,
			"ДеревоПересекающихсяУведомлений.Уровень", 2, ВидСравненияКомпоновкиДанных.Равно);
		
		Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьРежимыОбработкиДокумента()
	
	РежимыОбработкиДокументаИзменяемая = Новый Структура;
	РежимыОбработкиДокументаИзменяемая.Вставить("РежимСверки"    , "РежимСверки");
	РежимыОбработкиДокументаИзменяемая.Вставить("РежимОформления", "РежимОформления");
	РежимыОбработкиДокументаИзменяемая.Вставить("РежимПросмотра" , "РежимПросмотра");
	
	РежимыОбработкиДокумента = Новый ФиксированнаяСтруктура(РежимыОбработкиДокументаИзменяемая);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДеревоПересекающихсяУведомлений()
	
	ТекущиеДанные = Элементы.ДеревоУведомлений.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийДокументУведомление = ТекущиеДанные.ДокументУведомление;
	Если Не ЗначениеЗаполнено(ТекущийДокументУведомление) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаВсплывающаяДеревоПересекающихсяУведомлений.Показать();
	
	СтрокиДереваПересекающихсяУведомлений = ДеревоПересекающихсяУведомлений.ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из СтрокиДереваПересекающихсяУведомлений Цикл
		ТекущаяСтрока = СтрокаДерева.ПолучитьИдентификатор();
		Если СтрокаДерева.ДокументУведомление = ТекущийДокументУведомление Тогда
			Элементы.ДеревоПересекающихсяУведомлений.ТекущаяСтрока = ТекущаяСтрока;
			Элементы.ДеревоПересекающихсяУведомлений.Развернуть(ТекущаяСтрока, Истина);
		Иначе
			Элементы.ДеревоПересекающихсяУведомлений.Свернуть(ТекущаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ОбновлениеДанных

&НаКлиенте
Процедура ОбновитьДеревоУведомленийОтложенно()
	
	ОбновитьДеревоУведомлений();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоУведомлений()
	
	ДеревоУведомлений.ПолучитьЭлементы().Очистить();
	ДеревоПересекающихсяУведомлений.ПолучитьЭлементы().Очистить();
	
	ТекстыЗапроса = Новый Массив;
	ТекстыЗапроса.Добавить(ТекстЗапросаТипыУведомлений());
	ТекстыЗапроса.Добавить(ТекстЗапросаИнвентаризированныеУпаковки());
	ТекстыЗапроса.Добавить(ТекстЗапросаНомераУпаковокУведомлений());
	ТекстыЗапроса.Добавить(ТекстЗапросаСводныеДанныеУпаковок());
	ТекстыЗапроса.Добавить(ТекстЗапросаПересекающиесяНомераУпаковок());
	ТекстыЗапроса.Добавить(ТекстЗапросаДеревоПересекающихсяУведомлений());
	ТекстыЗапроса.Добавить(ТекстЗапросаДеревоУведомлений());
	
	Запрос = Новый Запрос(СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов()));
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("ТипыУведомлений", СформироватьТаблицуТиповУведомлений());
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ЗаполнитьДеревоПересекающихсяУведомлений(Результаты[Результаты.ВГраница() - 1].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам));
	ЗаполнитьДеревоУведомлений(Результаты[Результаты.ВГраница()].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам));
	
КонецПроцедуры

&НаСервере
Функция СформироватьТаблицуТиповУведомлений()
	
	СоответствиеТиповДокументов = ИнвентаризацияМДЛПКлиентСервер.СоответствиеТиповДокументовДействиямИнвентаризации();
	
	ТипыУведомлений = Новый ТаблицаЗначений;
	ТипыУведомлений.Колонки.Добавить("ДействиеПоОформлениюУведомлений", Новый ОписаниеТипов("ПеречислениеСсылка.ДальнейшиеДействияИнвентаризацииМДЛП"));
	ТипыУведомлений.Колонки.Добавить("ДокументУведомлениеТип", Метаданные.ОпределяемыеТипы.УведомлениеИнвентаризацииПотребительскихУпаковокМДЛП.Тип);
	
	Для Каждого КлючИЗначение Из СоответствиеТиповДокументов Цикл
		
		СтрокаТаблицы = ТипыУведомлений.Добавить();
		СтрокаТаблицы.ДействиеПоОформлениюУведомлений = КлючИЗначение.Ключ;
		СтрокаТаблицы.ДокументУведомлениеТип = КлючИЗначение.Значение;
		
	КонецЦикла;
	
	Возврат ТипыУведомлений;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаТипыУведомлений()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТипыУведомлений.ДействиеПоОформлениюУведомлений  КАК ДействиеПоОформлениюУведомлений,
	|	ТипыУведомлений.ДокументУведомлениеТип           КАК ДокументУведомлениеТип
	|ПОМЕСТИТЬ ТипыУведомлений
	|ИЗ
	|	&ТипыУведомлений КАК ТипыУведомлений
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаИнвентаризированныеУпаковки()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ИнвентаризированныеУпаковки.НомерУпаковки                    КАК НомерУпаковки,
	|	ИнвентаризированныеУпаковки.ДокументУведомление              КАК ДокументУведомление,
	|	ВЫБОР
	|		КОГДА ИнвентаризированныеУпаковки.ДокументУведомление <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ТИПЗНАЧЕНИЯ(ИнвентаризированныеУпаковки.ДокументУведомление)
	|		ИНАЧЕ ТИПЗНАЧЕНИЯ(ТипыУведомлений.ДокументУведомлениеТип)
	|	КОНЕЦ                                                        КАК ДокументУведомлениеТип
	|ПОМЕСТИТЬ ИнвентаризированныеУпаковки
	|ИЗ
	|	РегистрСведений.ИнвентаризированныеУпаковкиМДЛП КАК ИнвентаризированныеУпаковки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ТипыУведомлений КАК ТипыУведомлений
	|		ПО
	|			ТипыУведомлений.ДействиеПоОформлениюУведомлений = ИнвентаризированныеУпаковки.ДействиеПоОформлениюУведомлений
	|ГДЕ
	|	ИнвентаризированныеУпаковки.ДокументИнвентаризации = &Документ
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаНомераУпаковокУведомлений()
	
	ШаблонТекстаЗапросаУведомлений = "
	|ВЫБРАТЬ
	|	НомераУпаковокУведомления.НомерКИЗ  КАК НомерУпаковки,
	|	Уведомление.Ссылка                  КАК ДокументУведомление,
	|	ТИПЗНАЧЕНИЯ(Уведомление.Ссылка)     КАК ДокументУведомлениеТип
	|ИЗ
	|	#Уведомление КАК Уведомление
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			#Уведомление.НомераУпаковок КАК НомераУпаковокУведомления
	|		ПО
	|			НомераУпаковокУведомления.Ссылка = Уведомление.Ссылка
	|ГДЕ
	|	Уведомление.ДокументИнвентаризации = &Документ
	|	И НЕ Уведомление.ПометкаУдаления
	|";
	
	ТекстОбъединитьВсе = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|";
	
	ТекстыЗапроса = Новый Массив;
	
	ТипыУведомлений = Метаданные.ОпределяемыеТипы.УведомлениеИнвентаризацииПотребительскихУпаковокМДЛП.Тип.Типы();
	Для Каждого ТипУведомления Из ТипыУведомлений Цикл
		ТекстыЗапроса.Добавить(СтрЗаменить(ШаблонТекстаЗапросаУведомлений, "#Уведомление", Метаданные.НайтиПоТипу(ТипУведомления).ПолноеИмя()));
	КонецЦикла;
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, ТекстОбъединитьВсе);
	ИнвентаризацияМДЛП.ДобавитьИмяВременнойТаблицыПоследнемуЗапросуПакета(ТекстЗапроса, "НомераУпаковокУведомлений");
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаСводныеДанныеУпаковок()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ИнвентаризированныеУпаковки.НомерУпаковки           КАК НомерУпаковки,
	|	ИнвентаризированныеУпаковки.ДокументУведомление     КАК ДокументУведомление,
	|	ИнвентаризированныеУпаковки.ДокументУведомлениеТип  КАК ДокументУведомлениеТип
	|ПОМЕСТИТЬ СводныеДанныеУпаковок
	|ИЗ
	|	ИнвентаризированныеУпаковки КАК ИнвентаризированныеУпаковки
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НомераУпаковокУведомлений.НомерУпаковки             КАК НомерУпаковки,
	|	НомераУпаковокУведомлений.ДокументУведомление       КАК ДокументУведомление,
	|	НомераУпаковокУведомлений.ДокументУведомлениеТип    КАК ДокументУведомлениеТип
	|ИЗ
	|	НомераУпаковокУведомлений КАК НомераУпаковокУведомлений
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаПересекающиесяНомераУпаковок()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	СводныеДанныеУпаковок.НомерУпаковки  КАК НомерУпаковки
	|ПОМЕСТИТЬ ПересекающиесяНомераУпаковок
	|ИЗ
	|	СводныеДанныеУпаковок КАК СводныеДанныеУпаковок
	|ГДЕ
	|	СводныеДанныеУпаковок.ДокументУведомление <> НЕОПРЕДЕЛЕНО
	|СГРУППИРОВАТЬ ПО
	|	СводныеДанныеУпаковок.НомерУпаковки
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СводныеДанныеУпаковок.ДокументУведомление) > 1
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаДеревоПересекающихсяУведомлений()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	СводныеДанныеУпаковок.ДокументУведомление                           КАК ДокументУведомление,
	|	ПересекающиесяУведомления.ДокументУведомление                       КАК ДокументУведомлениеПересекающийся,
	|	СтатусыИнформированияУведомления.Статус                             КАК СтатусУведомления,
	|	СтатусыИнформированияУведомления.ДальнейшееДействие1                КАК ДальнейшееДействиеУведомления,
	|	СтатусыИнформированияУведомленияПересекающийся.Статус               КАК СтатусУведомленияПересекающийся,
	|	СтатусыИнформированияУведомленияПересекающийся.ДальнейшееДействие1  КАК ДальнейшееДействиеУведомленияПересекающийся,
	|	СводныеДанныеУпаковок.НомерУпаковки                                 КАК НомерУпаковки
	|ИЗ
	|	СводныеДанныеУпаковок КАК СводныеДанныеУпаковок
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.СтатусыИнформированияМДЛП КАК СтатусыИнформированияУведомления
	|		ПО
	|			СтатусыИнформированияУведомления.Документ = СводныеДанныеУпаковок.ДокументУведомление
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			СводныеДанныеУпаковок КАК ПересекающиесяУведомления
	|				ЛЕВОЕ СОЕДИНЕНИЕ
	|					РегистрСведений.СтатусыИнформированияМДЛП КАК СтатусыИнформированияУведомленияПересекающийся
	|				ПО
	|					СтатусыИнформированияУведомленияПересекающийся.Документ = ПересекающиесяУведомления.ДокументУведомление
	|		
	|		ПО
	|			ПересекающиесяУведомления.НомерУпаковки = СводныеДанныеУпаковок.НомерУпаковки
	|			И ПересекающиесяУведомления.ДокументУведомление <> СводныеДанныеУпаковок.ДокументУведомление
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ПересекающиесяНомераУпаковок КАК ПересекающиесяНомераУпаковок
	|		ПО
	|			ПересекающиесяНомераУпаковок.НомерУпаковки = СводныеДанныеУпаковок.НомерУпаковки
	|		
	|ГДЕ
	|	СводныеДанныеУпаковок.ДокументУведомление <> НЕОПРЕДЕЛЕНО
	|	И ПересекающиесяУведомления.ДокументУведомление <> НЕОПРЕДЕЛЕНО
	|ИТОГИ
	|	МАКСИМУМ(СтатусУведомления),
	|	МАКСИМУМ(ДальнейшееДействиеУведомления),
	|	МАКСИМУМ(СтатусУведомленияПересекающийся),
	|	МАКСИМУМ(ДальнейшееДействиеУведомленияПересекающийся)
	|ПО
	|	ДокументУведомление,
	|	ДокументУведомлениеПересекающийся
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаДеревоУведомлений()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	СводныеДанныеУпаковок.ДокументУведомлениеТип  КАК ДокументУведомлениеТип,
	|	СводныеДанныеУпаковок.ДокументУведомление     КАК ДокументУведомление,
	|	СтатусыИнформирования.Статус                  КАК СтатусУведомления,
	|	СтатусыИнформирования.ДальнейшееДействие1     КАК ДальнейшееДействиеУведомления,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА НЕ ПересекающиесяНомераУпаковок.НомерУпаковки ЕСТЬ NULL
	|			И СводныеДанныеУпаковок.ДокументУведомление <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ)                                        КАК ЕстьПересекающиесяУведомления
	|ИЗ
	|	СводныеДанныеУпаковок КАК СводныеДанныеУпаковок
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.СтатусыИнформированияМДЛП КАК СтатусыИнформирования
	|		ПО
	|			СтатусыИнформирования.Документ = СводныеДанныеУпаковок.ДокументУведомление
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ПересекающиесяНомераУпаковок КАК ПересекающиесяНомераУпаковок
	|		ПО
	|			ПересекающиесяНомераУпаковок.НомерУпаковки = СводныеДанныеУпаковок.НомерУпаковки
	|СГРУППИРОВАТЬ ПО
	|	СводныеДанныеУпаковок.ДокументУведомлениеТип,
	|	СводныеДанныеУпаковок.ДокументУведомление,
	|	СтатусыИнформирования.Статус,
	|	СтатусыИнформирования.ДальнейшееДействие1
	|УПОРЯДОЧИТЬ ПО
	|	ДокументУведомлениеТип,
	|	ДокументУведомление УБЫВ
	|ИТОГИ ПО
	|	ДокументУведомлениеТип
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоПересекающихсяУведомлений(ИсходноеДерево)
	
	ИсходноеДерево.Колонки.Добавить("Уровень");
	
	ПараметрыОбхода = ИнтеграцияМДЛП.ПараметрыОбходаДерева(ИсходноеДерево);
	Пока Истина Цикл
		
		ЭлементДерева = ИнтеграцияМДЛП.ПолучитьОчереднойЭлементДерева(ПараметрыОбхода);
		Если ЭлементДерева = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		ЭлементДерева.Уровень = ЭлементДерева.Уровень();
		Если ЭлементДерева.Уровень = 0 Тогда
			
			ЭлементДерева.СтатусУведомленияПересекающийся             = Неопределено;
			ЭлементДерева.ДальнейшееДействиеУведомленияПересекающийся = Неопределено;
			
		ИначеЕсли ЭлементДерева.Уровень = 1 Тогда
			
			ЭлементДерева.СтатусУведомления             = Неопределено;
			ЭлементДерева.ДальнейшееДействиеУведомления = Неопределено;
			
		ИначеЕсли ЭлементДерева.Уровень = 2 Тогда
			
			ЭлементДерева.СтатусУведомления                           = Неопределено;
			ЭлементДерева.ДальнейшееДействиеУведомления               = Неопределено;
			ЭлементДерева.СтатусУведомленияПересекающийся             = Неопределено;
			ЭлементДерева.ДальнейшееДействиеУведомленияПересекающийся = Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ИсходноеДерево, "ДеревоПересекающихсяУведомлений");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоУведомлений(ИсходноеДерево)
	
	ИсходноеДерево.Колонки.Добавить("ДокументУведомлениеПредставление");
	ИсходноеДерево.Колонки.Добавить("ДокументУведомлениеПолноеИмя");
	ИсходноеДерево.Колонки.Добавить("Примечание");
	ИсходноеДерево.Колонки.Добавить("Уровень");
	
	ПараметрыОбхода = ИнтеграцияМДЛП.ПараметрыОбходаДерева(ИсходноеДерево);
	Пока Истина Цикл
		
		ЭлементДерева = ИнтеграцияМДЛП.ПолучитьОчереднойЭлементДерева(ПараметрыОбхода);
		Если ЭлементДерева = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		ЭлементДерева.ДокументУведомлениеПолноеИмя = Метаданные.НайтиПоТипу(ЭлементДерева.ДокументУведомлениеТип).ПолноеИмя();
		
		ЭлементДерева.Уровень = ЭлементДерева.Уровень();
		Если ЭлементДерева.Уровень = 1 Тогда
			
			Если ЗначениеЗаполнено(ЭлементДерева.ДокументУведомление) Тогда
				ЭлементДерева.ДокументУведомлениеПредставление = ЭлементДерева.ДокументУведомление;
			Иначе
				ЭлементДерева.ДокументУведомлениеПредставление = Строка_Создать();
			КонецЕсли;
			
			Если ЭлементДерева.ЕстьПересекающиесяУведомления Тогда
				ЭлементДерева.Примечание = НСтр("ru = 'Есть пересекающиеся уведомления'");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ИсходноеДерево, "ДеревоУведомлений");
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиентеНаСервереБезКонтекста
Функция Строка_Создать()
	
	Возврат НСтр("ru = 'Создать'");
	
КонецФункции

#КонецОбласти

#КонецОбласти // СлужебныеПроцедурыИФункции
